In [1]:
import pandas as pd
import numpy as np

In [4]:
CAC_40 = pd.read_csv('CAC 40 7635.csv')

In [9]:
CAC_40.head()

        Date   cac_40
0  28-Aug-17  5079.75
1  25-Aug-17  5104.33
2  24-Aug-17  5113.13
3  23-Aug-17  5115.39
4  22-Aug-17  5131.86

In [8]:
CAC_40.cac_40 = CAC_40.cac_40.str.replace(',', '')

In [10]:
CAC_40.cac_40 = CAC_40.cac_40.astype(float)

In [12]:
CAC_40.Date = pd.to_datetime(CAC_40.Date)
CAC_40.set_index('Date', inplace=True)

In [13]:
CAC_40.head()

             cac_40
Date
2017-08-28  5079.75
2017-08-25  5104.33
2017-08-24  5113.13
2017-08-23  5115.39
2017-08-22  5131.86

In [14]:
CAD_50 = pd.read_csv('Canada 50 4078.csv')

In [15]:
CAD_50.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4077 entries, 0 to 4076
Data columns (total 2 columns):
Date      4077 non-null object
cad_50    4077 non-null float64
dtypes: float64(1), object(1)
memory usage: 63.8+ KB

In [17]:
CAD_50.Date = pd.to_datetime(CAD_50.Date)
CAD_50.set_index('Date', inplace=True)

In [18]:
CAD_50.head()

            cad_50
Date
2017-08-16  258.69
2017-08-15  258.62
2017-08-14  258.99
2017-08-11  257.18
2017-08-10  258.04

In [19]:
dax = pd.read_csv('DAX 4233.csv')

In [21]:
dax.head()

        Date    ger_dax
0  16-Aug-17  12,263.86
1  15-Aug-17  12,177.04
2  14-Aug-17  12,165.12
3  11-Aug-17  12,014.06
4  10-Aug-17  12,014.30

In [23]:
dax.ger_dax = dax.ger_dax.str.replace(',', '')

In [24]:
dax.ger_dax = dax.ger_dax.astype(float)

In [26]:
dax.Date = pd.to_datetime(dax.Date)
dax.set_index('Date', inplace=True)

In [27]:
dax.head()

             ger_dax
Date
2017-08-16  12263.86
2017-08-15  12177.04
2017-08-14  12165.12
2017-08-11  12014.06
2017-08-10  12014.30

In [31]:
dow = pd.read_csv('Dow Jones 30 3949.csv')

In [32]:
dow.head()

        Date  dow_jones
0  16-Aug-17  21,994.00
1  15-Aug-17  21,977.00
2  14-Aug-17  21,952.00
3  13-Aug-17  21,897.50
4  11-Aug-17  21,848.00

In [33]:
dow.dow_jones = dow.dow_jones.str.replace(',', '')

In [34]:
dow.dow_jones = dow.dow_jones.astype(float)

In [35]:
dow.Date = pd.to_datetime(dow.Date)
dow.set_index('Date', inplace=True)

In [36]:
dow.head()

            dow_jones
Date
2017-08-16    21994.0
2017-08-15    21977.0
2017-08-14    21952.0
2017-08-13    21897.5
2017-08-11    21848.0

In [39]:
eu_stoxx = pd.read_csv('Euro Stoxx 50.csv')

In [41]:
eu_stoxx.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3824 entries, 0 to 3823
Data columns (total 2 columns):
Date           3824 non-null object
eu_stoxx_50    3824 non-null float64
dtypes: float64(1), object(1)
memory usage: 59.8+ KB

In [97]:
eu_stoxx.Date = pd.to_datetime(eu_stoxx.Date)
eu_stoxx.set_index('Date', inplace=True)

In [98]:
eu_stoxx.head()

            eu_stoxx_50
Date
2002-08-08       2734.0
2002-08-09       2770.0
2002-08-12       2675.0
2002-08-13       2712.0
2002-08-14       2630.0

In [42]:
ftse = pd.read_csv('FTSE 100 4199.csv')

In [44]:
ftse.uk_ftse = ftse.uk_ftse.str.replace(',', '')

In [45]:
ftse.uk_ftse = ftse.uk_ftse.astype(float)

In [46]:
ftse.Date = pd.to_datetime(ftse.Date)
ftse.set_index('Date', inplace=True)

In [90]:
ftse.head()

            uk_ftse
Date
2017-08-16  7433.03
2017-08-15  7383.85
2017-08-14  7353.89
2017-08-11  7309.96
2017-08-10  7389.94

In [48]:
ibex = pd.read_csv('IBEX 35 4341.csv')
ibex.head()

        Date spain_ibex
0  16-Aug-17  10,544.30
1  15-Aug-17  10,481.50
2  14-Aug-17  10,461.20
3  11-Aug-17  10,282.90
4  10-Aug-17  10,450.00

In [49]:
ibex.spain_ibex = ibex.spain_ibex.str.replace(',', '')

In [50]:
ibex.spain_ibex = ibex.spain_ibex.astype(float)

In [52]:
ibex.Date = pd.to_datetime(ibex.Date)
ibex.set_index('Date', inplace=True)
ibex.head()

            spain_ibex
Date
2017-08-16     10544.3
2017-08-15     10481.5
2017-08-14     10461.2
2017-08-11     10282.9
2017-08-10     10450.0

In [56]:
nsq = pd.read_csv('NASDAQ Composite 4300.csv')

In [57]:
nsq.head()

        Date    nasdaq
0  16-Aug-17  6,344.29
1  15-Aug-17  6,333.01
2  14-Aug-17  6,340.23
3  11-Aug-17  6,256.56
4  10-Aug-17  6,216.87

In [58]:
nsq.nasdaq = nsq.nasdaq.str.replace(',','')

In [59]:
nsq.nasdaq = nsq.nasdaq.astype(float)

In [60]:
nsq.Date = pd.to_datetime(nsq.Date)
nsq.set_index('Date', inplace=True)
nsq.head()

             nasdaq
Date
2017-08-16  6344.29
2017-08-15  6333.01
2017-08-14  6340.23
2017-08-11  6256.56
2017-08-10  6216.87

In [61]:
nikkei = pd.read_csv('Nikkei 225 4094.csv')

In [66]:
nikkei.head()

        Date jap_nikkei
0  16-Aug-17   19729.28
1  15-Aug-17   19753.31
2  14-Aug-17   19537.10
3  13-Aug-17   19556.00
4  10-Aug-17   19729.74

In [65]:
nikkei.jap_nikkei = nikkei.jap_nikkei.str.replace(',', '')

In [67]:
nikkei.jap_nikkei = nikkei.jap_nikkei.astype(float)

In [68]:
nikkei.Date = pd.to_datetime(nikkei.Date)
nikkei.set_index('Date', inplace=True)
nikkei.head()

            jap_nikkei
Date
2017-08-16    19729.28
2017-08-15    19753.31
2017-08-14    19537.10
2017-08-13    19556.00
2017-08-10    19729.74

In [69]:
omx = pd.read_csv('OMX Stockholm 30 7749.csv')

In [70]:
omx.head()

        Date  swed_omx
0  16-Aug-17  1,552.16
1  15-Aug-17  1,543.38
2  14-Aug-17  1,554.58
3  11-Aug-17  1,538.96
4  10-Aug-17  1,554.75

In [71]:
omx.swed_omx = omx.swed_omx.str.replace(',', '')

In [72]:
omx.swed_omx = omx.swed_omx.astype(float)

In [73]:
omx.Date = pd.to_datetime(omx.Date)
omx.set_index('Date', inplace=True)
omx.head()

            swed_omx
Date
2017-08-16   1552.16
2017-08-15   1543.38
2017-08-14   1554.58
2017-08-11   1538.96
2017-08-10   1554.75

In [74]:
s_and_p = pd.read_csv('S&P 500.csv')

In [76]:
s_and_p.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4352 entries, 0 to 4351
Data columns (total 2 columns):
Date       4352 non-null object
s_p_500    4352 non-null float64
dtypes: float64(1), object(1)
memory usage: 68.1+ KB

In [77]:
s_and_p.Date = pd.to_datetime(s_and_p.Date)
s_and_p.set_index('Date', inplace=True)
s_and_p.head()

            s_p_500
Date
2000-05-01  1468.25
2000-05-02  1446.09
2000-05-03  1415.10
2000-05-04  1409.38
2000-05-05  1432.63

In [78]:
china_comp = pd.read_csv('Shanghai Composite 6521.csv')

In [79]:
china_comp.head()

        Date shanghai_composite
0  16-Aug-17           3,246.45
1  15-Aug-17           3,251.26
2  14-Aug-17           3,237.36
3  11-Aug-17           3,208.54
4  10-Aug-17           3,261.75

In [80]:
china_comp.shanghai_composite = china_comp.shanghai_composite.str.replace(',', '')

In [81]:
china_comp.shanghai_composite = china_comp.shanghai_composite.astype(float)

In [82]:
china_comp.Date = pd.to_datetime(china_comp.Date)
china_comp.set_index('Date', inplace=True)
china_comp.head()

            shanghai_composite
Date
2017-08-16             3246.45
2017-08-15             3251.26
2017-08-14             3237.36
2017-08-11             3208.54
2017-08-10             3261.75

In [83]:
swis_smi = pd.read_csv('Sw SMI 4193.csv')

In [84]:
swis_smi.head()

        Date Swis_smi_index
0  16-Aug-17       9,037.92
1  15-Aug-17       9,012.52
2  14-Aug-17       9,031.27
3  11-Aug-17       8,884.04
4  10-Aug-17       8,949.86

In [85]:
swis_smi.Swis_smi_index = swis_smi.Swis_smi_index.str.replace(',', '')

In [86]:
swis_smi.Swis_smi_index = swis_smi.Swis_smi_index.astype(float)

In [87]:
swis_smi.Date = pd.to_datetime(swis_smi.Date)
swis_smi.set_index('Date', inplace=True)
swis_smi.head()

            Swis_smi_index
Date
2017-08-16         9037.92
2017-08-15         9012.52
2017-08-14         9031.27
2017-08-11         8884.04
2017-08-10         8949.86

In [99]:
all_indices = CAC_40.join([s_and_p, china_comp, swis_smi, CAD_50, dax, dow, ftse, ibex, nsq, nikkei, omx, eu_stoxx], how='outer')

In [101]:
all_indices.to_csv('all_indices.csv')